app/controllers/posts_controller.rb

  def create
  	@post = Post.create(title: params[:title], description: params[:description])
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "jason"], ["description", "sutter"], ["created_at", 2017-03-27 19:42:40 UTC], ["updated_at", 2017-03-27 19:42:40 UTC]]

  def destroy
  	@post = Post.find(params[:id])
  	@post.destroy()
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]